from openpyxl import load_workbook

courses = ['1 курс', '2 курс', '3 курс', '4 курс']
kurs4 = {'4КСК7': 4, '4ПКС8': 6, '4АК4': 8, '4Т7': 10, '4Д2': 12, '4ПП2': 14}
kurs3 = {'3КСК8': 4, '3КСК9': 6, '3ПКС9': 8, '3ПКС10': 10, '3АК6': 12, '3Ф6': 14, '3Т9': 16, '3Т10': 18, '3ОДЛ6': 20, '3ИД1': 2, '3Д3': 24, '3ПП3': 26}
days = {0: 'Понедельник', 1: 'Вторник', 2: 'Среда', 3: 'Четверг', 4: 'Пятница', 5: 'Суббота'}
kurs2 = {'2КСК10': 3, '2КСК11': 5, '2ПКС11': 7, '2ПКС12': 9, '2АК7': 11, '2Ф7': 13, '2Т11': 15, '2Т12': 17, '2ОДЛ7': 19, '2ИД2': 21, '2Д4': 23}
msg = {'text': ''}
msg['text'] = 'Под'
with open('teachers.txt', 'r') as f:
    teachers = [line.strip() for line in f]
#teachers = set(teachers)
fil = [elem for elem in teachers if msg['text'] in elem]
print(fil)
